app/views/tasks/_form.html.slim

  br
  - if !@task.attachments.empty?
    .panel.panel-default
      .panel-heading
---
SELECT  1 AS one FROM "attachments" WHERE "attachments"."task_id" = ? LIMIT 1  [["task_id", 23]]
SELECT "attachments".* FROM "attachments" WHERE "attachments"."task_id" = ?  [["task_id", 8]]