app/views/pages/control_panel.html.slim

-if (!current_user.nil? && current_user.client.empty?)
	.col-mid-6
		.alert.alert-danger role="alert"
---
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT  1 AS one FROM "clients" WHERE "clients"."user_id" = ? LIMIT 1  [["user_id", 1]]