app/controllers/carts_controller.rb

  def add_item
    if(params.has_key?(:task_id) && Task.exists?(params[:task_id]))
      respond_to do |format|
        if(CartItem.exists?(cart_id: @cart.id, task_id: params[:task_id]))
          format.html { redirect_to :back, alert: 'Данная задача уже добавленная в корзину' }
        else
          @cart.cart_items << CartItem.create(cart_id: @cart.id, task_id: params[:task_id])
---
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."task_id" = ? LIMIT 1  [["cart_id", 1], ["task_id", 1]]
INSERT INTO "cart_items" ("cart_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["task_id", 1], ["created_at", "2016-06-16 14:11:14.396372"], ["updated_at", "2016-06-16 14:11:14.396372"]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2016-06-16 12:57:34.787917"], ["updated_at", "2016-06-16 12:57:34.787917"]]