app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE (user_id = 2)
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT 1  [["user_id", 2]]
---
  def index
    if(current_user.is_admin?)
      @clients = Client.all
    else
      @clients = Client.where("user_id = ?", current_user.id)

INSERT INTO "clients" ("name", "fio", "site", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "ООО 1"], ["fio", "Ф И О"], ["site", "адрес"], ["description", "Описанике"], ["user_id", 1], ["created_at", "2016-06-07 13:37:09.920579"], ["updated_at", "2016-06-07 13:37:09.920579"]]
---
  def create
    @client = Client.new(client_params)
    @client.user_id = current_user.id

    respond_to do |format|
      if @client.save

UPDATE "clients" SET "name" = ?, "fio" = ?, "description" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name", "new name"], ["fio", "new fio"], ["description", "new desc"], ["updated_at", "2016-06-15 18:52:51.638015"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @client.update(client_params)

DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]
---
  def destroy
    @client.destroy

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_client
      @client = Client.find_by_id(params[:id])