app/controllers/clients_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
    def set_client
      @client = Client.find_by_user_id(current_user.id)