app/controllers/comments_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", nil]]
---
	def set_task

		if (!params.has_key?(:task_id) ||
					  !Task.exists?(id: params[:task_id]))
			render_404
		else
		 	@task = Task.find(params[:task_id])