app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings"
---
  def index
    @settings = Setting.all

INSERT INTO "settings" ("name", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "default_task_type_id"], ["value", "1"], ["created_at", "2016-06-08 16:54:46.178156"], ["updated_at", "2016-06-08 16:54:46.178156"]]
---
  def create
    @setting = Setting.new(setting_params)

    respond_to do |format|
      if @setting.save

UPDATE "settings" SET "description" = ?, "updated_at" = ? WHERE "settings"."id" = ?  [["description", "Состояние задачи задаваемое по умолчанию"], ["updated_at", "2016-06-08 17:01:33.588255"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @setting.update(setting_params)

DELETE FROM "settings" WHERE "settings"."id" = ?  [["id", 1]]
---
  def destroy
    @setting.destroy

SELECT  "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_setting
      @setting = Setting.find(params[:id])