app/controllers/tasks_controller.rb

  def index
    clients = Client.where("user_id = ?", current_user.id).select(:id).to_a
    if !clients.nil?
      @tasks = Task.includes(:client).includes(:task_status).where("client_id IN (?)",clients)
---
SELECT "clients"."id" FROM "clients" WHERE (user_id = 2)
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."client_id" = ? LIMIT 1  [["client_id", 2]]
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (1)
SELECT "task_statuses".* FROM "task_statuses" WHERE "task_statuses"."id" IN (2, 1)

  def create
    @task = Task.new(task_params)
    @task.task_status_id = @default_task_status_id

    respond_to do |format|
      if @task.save

        params[:attachments_source].count.times do |a|
          @task.attachments.create!(name: params[:attachments_name][a], source: params[:attachments_source][a])
---
INSERT INTO "tasks" ("title", "description", "client_id", "task_status_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Задача №6"], ["description", "Описание Задача №6"], ["client_id", 8], ["task_status_id", 2], ["created_at", "2016-06-08 20:29:21.515769"], ["updated_at", "2016-06-08 20:29:21.515769"]]
INSERT INTO "attachments" ("source", "name", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["source", "_____.txt"], ["name", "Attachment"], ["task_id", 16], ["created_at", "2016-06-09 10:08:16.265594"], ["updated_at", "2016-06-09 10:08:16.265594"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Задача №222"], ["updated_at", "2016-06-10 05:00:11.498228"], ["id", 25]]

  def download_attachment
    att = Attachment.find(params[:id])
---
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT 1  [["id", 8]]