app/controllers/task_statuses_controller.rb

  def index
    @task_statuses = TaskStatus.all
---
SELECT "task_statuses".* FROM "task_statuses"

  def create
    @task_status = TaskStatus.new(task_status_params)

    respond_to do |format|
      if @task_status.save
---
INSERT INTO "task_statuses" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Новая"], ["created_at", "2016-06-08 14:43:47.885277"], ["updated_at", "2016-06-08 14:43:47.885277"]]

    def set_task_status
      @task_status = TaskStatus.find(params[:id])
---
SELECT  "task_statuses".* FROM "task_statuses" WHERE "task_statuses"."id" = ? LIMIT 1  [["id", 1]]